glm-disagg/results/qps/2ptp1_1dtp2/result_qps16.txt

==============================================
Discovering model server pods in namespace: raj-network-debug
==============================================
  Detected:     glm-disagg
  Decode pod:   ms-glm-disagg-llm-d-modelservice-decode-8599766875-765qr
  Decode log:   results/qps/2ptp1_1dtp2//decode_qps16.log
  Prefill pod:  ms-glm-disagg-llm-d-modelservice-prefill-8d997bcdf-8p7tw
  Prefill log:  results/qps/2ptp1_1dtp2//prefill_qps16.log
  Metrics from: prefill pods  IPs: 10.244.2.87 10.244.4.184  (port: 8000)
  NIXL from:    decode pods  IPs: 10.244.5.245  (port: 8200)

Starting decode pod log capture to results/qps/2ptp1_1dtp2//decode_qps16.log ...
Starting prefill pod log capture to results/qps/2ptp1_1dtp2//prefill_qps16.log ...

==============================================
Snapshotting Prometheus metrics (pre-benchmark)
==============================================
  10.244.2.87: queue(sum=95476.825651, count=1907) prefill(sum=6416.835074, count=1907)
  10.244.4.184: queue(sum=89227.548939, count=1877) prefill(sum=6325.497403, count=1877)
  NIXL (decode pods):
  10.244.5.245: xfer(sum=657.188222, count=7568) post(sum=12.943171, count=7568) bytes(sum=5073451089920, count=7568) desc(sum=309658880, count=7568)

==============================================
Running QPS Sweep via Poker Pod (timeout: 900s)
  Target: glm-disagg | QPS: 16
==============================================

Running: just TARGET_DURATION=30 MIN_PROMPTS=120 sweep-qps glm-disagg 4096 256 16

#!/usr/bin/env bash
URL=$(just _url glm-disagg)
RESP=$(curl -s "$URL/v1/models")
MODEL=$(echo "$RESP" | jq -r '.data[0].id' 2>/dev/null)
if [[ -z "$MODEL" || "$MODEL" == "null" ]]; then
  echo "ERROR: Could not detect model from glm-disagg. Response: $RESP" >&2
  exit 1
fi
echo "$MODEL"
SWEEP_QPS_START
CONFIG: target=glm-disagg model=RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic isl=4096 osl=256 gpu_count=4
TARGET_DURATION: 30s  MIN_PROMPTS: 120
REQUEST_RATE: 16 req/s (Poisson)  NUM_PROMPTS: 480

BENCH_RUN: request_rate=16 num_prompts=480
INFO 02-27 17:58:00 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 02-27 17:58:00 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 02-27 17:58:00 [interface.py:222] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 02-27 17:58:02 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x7fb8ee33ad40>, seed=57175757, num_prompts=480, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=4096, random_output_len=256, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai', base_url='http://infra-glm-disagg-inference-gateway-istio.raj-network-debug.svc.cluster.local', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=None, model='RedHatAI/Llama-3.3-70B-Instruct-FP8-dynamic', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=16.0, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=0, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-490d3e71-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None)
INFO 02-27 17:58:04 [datasets.py:612] Sampling input_len from [4095, 4095] and output_len from [256, 256]
  0%|          | 0/480 [00:00<?, ?it/s]WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: 16.0
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: None
100%|██████████| 480/480 [03:54<00:00,  2.04it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     480       
Failed requests:                         0         
Request rate configured (RPS):           16.00     
Benchmark duration (s):                  234.93    
Total input tokens:                      1965600   
Total generated tokens:                  122880    
Request throughput (req/s):              2.04      
Output token throughput (tok/s):         523.05    
Peak output token throughput (tok/s):    624.00    
Peak concurrent requests:                430.00    
Total token throughput (tok/s):          8889.79   
---------------Time to First Token----------------
Mean TTFT (ms):                          93848.70  
Median TTFT (ms):                        94014.34  
P99 TTFT (ms):                           196439.58 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          23.20     
Median TPOT (ms):                        23.42     
P99 TPOT (ms):                           23.57     
---------------Inter-token Latency----------------
Mean ITL (ms):                           23.20     
Median ITL (ms):                         23.35     
P99 ITL (ms):                            26.84     
==================================================
BENCH_RUN_END: request_rate=16

SWEEP_QPS_END

==============================================
Sweep Completed (exit 0)
==============================================

==============================================
Snapshotting Prometheus metrics (post-benchmark)
==============================================
  10.244.2.87: queue(sum=119854.340746, count=2164) prefill(sum=7328.969726, count=2164)
  10.244.4.184: queue(sum=107683.589397, count=2100) prefill(sum=7118.996628, count=2100)
  NIXL (decode pods):
  10.244.5.245: xfer(sum=741.565326, count=8528) post(sum=14.778744, count=8528) bytes(sum=5717696184320, count=8528) desc(sum=348980480, count=8528)

==============================================
Prometheus Metrics Summary (qps=16)
==============================================
Prefill Pod Metrics:
  Pod 10.244.2.87:
    request_queue_time:   avg = 94.854144 s  (count=257)
    request_prefill_time: avg = 3.549162 s  (count=257)
  Pod 10.244.4.184:
    request_queue_time:   avg = 82.762513 s  (count=223)
    request_prefill_time: avg = 3.558292 s  (count=223)
  System total (2 prefill pods):
    request_queue_time:   avg = 89.236574 s  (count=480)
    request_prefill_time: avg = 3.553404 s  (count=480)

NIXL KV Transfer Metrics (decode pods):
  Decode 10.244.5.245:
    total_transfers:    960
    avg_xfer_time:      87.893 ms
    avg_post_time:      1.912 ms
    avg_mb_per_xfer:    671.1 MB
    avg_descriptors:    40960

Stopping log captures...
Decode log:  results/qps/2ptp1_1dtp2//decode_qps16.log (49 lines, 16K)
Prefill log: results/qps/2ptp1_1dtp2//prefill_qps16.log (280 lines, 48K)